---
kind: method
id: M:Autodesk.Revit.DB.OverrideGraphicSettings.Dispose
source: html/b8a8449b-0b8f-edce-cb22-f10096548f42.htm
---
# Autodesk.Revit.DB.OverrideGraphicSettings.Dispose Method

Releases all resources used by the OverrideGraphicSettings

## Syntax (C#)
```csharp
public void Dispose()
```